x = 100      # 변수 x를 생성하고 100을 저장한다.
y = 200      # 변수 y를 생성하고 200을 저장한다.
sum = x+y    # 변수 sum을 생성하고 x+y를 저장한다.
print("합은", sum)

# 변수의 이름
# 의미있는 이름을 사용
# 소문자와 대문자느 서로 다르게 취급된다.
# 변수의 이름은 영문자와 숫자, 밑줄(_)로 이루어진다.
# 변수의 이름중간에 공백이 들어가면 안 된다.
# 단어를 구분하려면 밑줄(_)을 사용 한다.

# 예약어란?
# 파이썬이 사용하는 특수한 단어 - 파이썬에서 이미 사용하고있는 단어들

# size 가능하다. - 예약어,기호를 변수의 이름으로 사용하면 안된다.
# cloud9 가능하다. 변수는 영문자. 숫자. _로 이루어진다. - 숫자가 앞에오면 안된다.
# max_size 가능하다. 변수의 중간에 _가 있어도 된다. - 중간에 공백이 있으면 안된다.

# 낙타체
# 변수의 첫글자는 소문자로, 나머지 단어 의 첫 글자는 대문자로 적는 방법
# myNewCar처럼 첫 'm'은 소문자로, 나머지 단어들의 첫글자는 대문자로 표기
