# 횟수 제어 반복
# 제어문

# 조건문
# 연봉이 2500 이상이면 취업하고 아니면 고시 준비해야지

# 반복문
# 토익 점수가 600을 넘을 때까지 반복해서 공부해야지

# 반문의 환영합니다! 5번 반복
print("반문의 환영합니다!")
print("반문의 환영합니다!")
print("반문의 환영합니다!")
print("반문의 환영합니다!")
print("반문의 환영합니다!")

# 반문의 환영합니다! 5번 반복 for문
for i in range(5):print("반문의 환영합니다!")

# 반복의 종류

# 조건 반복(while문)
# 특정한 조건이 성립되는 동안 반복
# 기록이 1촏 단축될 때까지 반복하세요.

# 횟수 반복(for문)
# 정해진 횟수만큼 반복
# 트랙을 10바퀴 뛰세요.

# 횟수 반복
# 반복의 횟수를 미리 아는경우에 사용
# for 변수 in 시퀀스: 문장
# 시퀀스에 항목이 있는가?
# 시퀀스의 다음 할목 문장을 싱행한다.
# 시쿼스에 더 이상 항목이없으면 종료
